Repository: annatrybel/time-capsule
Catalog: TimeCapsule/TimeCapsule/Resources/Views/Home/Privacy.*.resx
Languages: pl

# AdminTitle
source: Data Controller
pl: Administrator danych

# AdminBody
source: The data controller is the team responsible for the “TimeCapsule” app.
pl: Administratorem danych osobowych jest zespół odpowiedzialny za projekt „TimeCapsule”.

# ContactInfo
source: For privacy inquiries, contact: <strong>timecapsule.kontakt@gmail.com</strong>
pl: W sprawach związanych z ochroną danych prosimy o kontakt: <strong>timecapsule.kontakt@gmail.com</strong>

# DataTypesTitle
source: Types of Data We Collect
pl: Zakres przetwarzanych danych

# DataTypesBody
source: When using the application, we process the following data:
pl: Podczas korzystania z aplikacji przetwarzamy następujące dane:

# DataTypesList1
source: user's email address,
pl: adres e-mail użytkownika,

# PurposeTitle
source: Purpose of Data Processing
pl: Cel przetwarzania danych

# DataTypesList2
source: password (encrypted),
pl: hasło (zaszyfrowane),

# DataTypesList3
source: capsule contents (title, message, attachments, etc.),
pl: treści kapsuł (tytuł, wiadomość, załączniki itp.),

# DataTypesList4
source: email addresses of capsule recipients,
pl: adresy e-mail odbiorców kapsuł,

# DataTypesList5
source: creation and opening dates of capsules.
pl: daty utworzenia i otwarcia kapsuł.

# PurposeBody
source: Your data is used to:
pl: Dane są przetwarzane w celu:

# PurposeList1
source: enable account registration and login (including via Google),
pl: umożliwienia rejestracji i logowania (również przez Google),

# PurposeList2
source: allow capsule creation and management,
pl: tworzenia i zarządzania kapsułami czasu,

# PurposeList3
source: send email notifications,
pl: wysyłania powiadomień e-mail,

# PurposeList4
source: ensure application security.
pl: zapewnienia bezpieczeństwa aplikacji.

# LegalTitle
source: Legal Basis
pl: Podstawy prawne

# LegalBody
source: Data is processed based on:
pl: Dane przetwarzamy na podstawie:

# LegalList1
source: Article 6(1)(b) GDPR – performance of a contract,
pl: art. 6 ust. 1 lit. b RODO – wykonanie umowy,

# LegalList2
source: Article 6(1)(f) GDPR – legitimate interest of the controller.
pl: art. 6 ust. 1 lit. f RODO – uzasadniony interes administratora.

# SharingTitle
source: Data Sharing
pl: Udostępnianie danych

# SharingBody
source: Data may be shared with external services:
pl: Dane mogą być przekazywane usługom zewnętrznym:

# SharingList1
source: Google – for Google login,
pl: Google – przy logowaniu kontem Google,

# SharingList2
source: Gmail SMTP – for sending capsule-related emails.
pl: Gmail SMTP – do wysyłki wiadomości e-mail z kapsułami.

# SharingNote
source: We do not share your data with third parties for marketing purposes.
pl: Nie przekazujemy danych podmiotom trzecim w celach marketingowych.

# RetentionTitle
source: Data Retention
pl: Czas przechowywania danych

# RetentionList1
source: Account data – stored until deletion or request to remove.
pl: Dane konta – do czasu usunięcia lub zgłoszenia prośby o usunięcie.

# RetentionList2
source: Capsules – stored until opened or removed.
pl: Kapsuły – do momentu ich otwarcia lub usunięcia.

# RightsTitle
source: User Rights
pl: Prawa użytkownika

# RightsBody
source: Every user has the right to:
pl: Użytkownik ma prawo do:

# RightsList1
source: access their data,
pl: dostępu do danych,

# RightsList2
source: correct it,
pl: sprostowania,

# RightsList3
source: delete it,
pl: usunięcia,

# RightsList4
source: restrict processing,
pl: ograniczenia przetwarzania,

# RightsList5
source: transfer their data,
pl: przenoszenia danych,

# RightsList6
source: file a complaint with a supervisory authority.
pl: złożenia skargi do PUODO.

# CookiesTitle
source: Cookies and Logs
pl: Cookies i logi

# CookiesBody
source: The application uses cookies to:
pl: Aplikacja używa plików cookies w celu:

# CookiesList1
source: maintain user session,
pl: utrzymania sesji użytkownika,

# CookiesList2
source: store data during capsule creation.
pl: przechowywania danych podczas tworzenia kapsuły.

# LogsNote
source: We also record basic system logs (e.g., errors) but do not store IP addresses.
pl: Zapisywane są także podstawowe logi systemowe (np. błędy), ale nie gromadzimy adresów IP.

# SecurityTitle
source: Security Measures
pl: Zabezpieczenia

# SecurityList1
source: Passwords are stored in encrypted form.
pl: Hasła przechowywane są w postaci zaszyfrowanej.

# SecurityList2
source: The application uses HTTPS encryption.
pl: Połączenie z aplikacją jest zabezpieczone certyfikatem HTTPS.

# SecurityList3
source: Only authorized users can access the admin panel.
pl: Dostęp do panelu administracyjnego mają wyłącznie użytkownicy z odpowiednimi rolami.

# ChangesTitle
source: Policy Changes
pl: Zmiany w polityce

# ChangesBody
source: If this privacy policy is updated, changes will be announced in the app.
pl: W przypadku aktualizacji polityki prywatności, zmiany zostaną ogłoszone w aplikacji.

# PageTitle
source: PRIVACY POLICY
pl: POLITYKA PRYWATNOŚCI
